Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Consumer pattern: An extension declares a `MetricsFactoryConsumerBuildItem` and uses that to provide a bytecode recorder to the metrics extension. When the metrics extension has initialized, it will iterate over registered consumers to initialize them with a `MetricsFactory`. This factory can be used to declare API-agnostic metrics, which can be a good fit for extensions that provide an instrumentable object for gathering statistics (e.g. Hibernate's `Statistics` class).
ja_jp: コンシューマーパターン: エクステンションは `MetricsFactoryConsumerBuildItem` を宣言し、それを使用してメトリクスエクステンションにバイトコードレコーダーを提供します。メトリクスエクステンションが初期化されると、登録されたコンシューマーを反復処理し、 `MetricsFactory` で初期化します。このファクトリーは、API に依存しないメトリクスの宣言に使用できます。これは、統計を収集するためのインストルメント可能なオブジェクト (Hibernate の `Statistics` クラスなど) を提供するエクステンションに適しています。

source: Consumer should take action when it receives a message that can not be decrypted. + * **FAIL**: this is the default option to fail messages until crypto succeeds. + * **DISCARD**: silently acknowledge and not deliver message to an application. + * **CONSUME**: deliver encrypted messages to applications. It is the application's responsibility to decrypt the message. The decompression of message fails. If messages contain batch messages, a client is not be able to retrieve individual messages in batch. Delivered encrypted message contains `EncryptionContext` which contains encryption and compression information in it using which application can decrypt consumed message payload.
ja_jp: コンシューマーは、復号化できないメッセージを受信した場合にアクションを取るべきです。+ * **FAIL**: これは、暗号化が成功するまでメッセージを失敗させるためのデフォルトのオプションです。+ * **DISCARD**: 静かに確認応答し、アプリケーションにメッセージを配信しません。+ * **CONSUME**: 暗号化されたメッセージをアプリケーションに配信します。メッセージを復号化するのはアプリケーションの責任です。 メッセージの解凍が失敗します。 メッセージにバッチメッセージが含まれている場合、クライアントはバッチ内の個々のメッセージを取得できません。 配信された暗号化メッセージには `EncryptionContext` が含まれており、それには暗号化および圧縮情報が含まれています。アプリケーションはこれを使用して、消費されたメッセージペイロードを復号化できます。

source: Consumer should take action when it receives a message that can not be decrypted. + * **FAIL**: this is the default option to fail messages until crypto succeeds. + * **DISCARD**:silently acknowledge and not deliver message to an application. + * **CONSUME**: deliver encrypted messages to applications. It is the application's responsibility to decrypt the message. The decompression of message fails. If messages contain batch messages, a client is not be able to retrieve individual messages in batch. Delivered encrypted message contains `EncryptionContext` which contains encryption and compression information in it using which application can decrypt consumed message payload.
ja_jp: 復号化できないメッセージを受信した場合、コンシューマーは以下のアクションを取る 必要があります。 * *FAIL* : 暗号化が成功するまでメッセージをフェイルするデフォルトのオプション。 ** DISCARD* :(メッセージを)黙認し、アプリケーションに配信しません。 ** CONSUME* ：暗号化されたメッセージをアプリケーションに配信します。メッセージを復号化するのはアプリケーションの責任です。

source: Consumers belong to a consumer group, identified with a name (`A` and `B` in the picture above). A group contains one or more consumers. In general, when you scale up your application, it creates a consumer joining the same group.
ja_jp: コンシューマーは、名前(上の図では `A` と `B` )で識別されるコンシューマーグループに属しています。1 つのグループには 1 つ以上のコンシューマーが含まれます。一般的に、アプリケーションをスケールアップすると、同じグループに参加するコンシューマーが作成されます。

source: Consumers create _subscriptions_ to those topics to receive and process incoming messages, and send _acknowledgments_ to the broker when processing is finished.
ja_jp: コンシューマーは、そのトピックへの _サブスクリプション_ を作成し、着信メッセージを受信して処理します。処理が完了すると、ブローカーに _完了通知_ を送信します。

source: Consumers of `BeanDiscoveryFinishedBuildItem` can easily inspect all class-based beans, observers and injection points registered in the application. However, synthetic beans and observers are _not included_ because this build item is produced _before_ the synthetic components are registered.
ja_jp: `BeanDiscoveryFinishedBuildItem` のコンシューマーは、アプリケーションに登録されているすべてのクラスベースの Bean、オブザーバー、およびインジェクションポイントを簡単に検査できます。ただし、このビルドアイテムは合成コンポーネントが登録される _前_ に作成されるため、合成 Bean とオブザーバーは _含まれません_ 。

source: Consumers of `SynthesisFinishedBuildItem` can easily inspect all beans, observers and injection points registered in the application. Synthetic beans and observers are included because this build item is produced _after_ the synthetic components are registered.
ja_jp: `SynthesisFinishedBuildItem` のコンシューマーは、アプリケーションに登録されているすべての Bean、オブザーバー、およびインジェクションポイントを簡単に検査できます。このビルドアイテムは合成コンポーネントが登録された _後_ に作成されるため、合成 Bean とオブザーバーも _含まれます_ 。

source: Consuming Cloud Event from Kafka
ja_jp: クラウドイベントをKafkaから消費する

source: Consuming GraphQL Services
ja_jp: GraphQLサービスの使用

source: Consuming Kubernetes ConfigMaps
ja_jp: Kubernetes ConfigMapsの使用

source: Consuming SSE events is possible simply by declaring the result type as a `io.smallrye.mutiny.Multi`.
ja_jp: SSE イベントは、結果の型を `io.smallrye.mutiny.Multi` と宣言するだけで使用できます。

source: Consuming a gRPC Service
ja_jp: gRPC サービスの使用

source: Consuming a gRPC service
ja_jp: gRPCサービスを消費する

source: Consuming events
ja_jp: イベントの消費

source: Consuming gRPC Services
ja_jp: gRPCサービスの使用

source: Consuming gRPC services requires the gRPC classes to be generated. Place your `proto` files in `src/main/proto` and run `mvn compile`.
ja_jp: gRPC サービスを消費するには、gRPC クラスを生成する必要があります。 `proto` ファイルを `src/main/proto` に置き、 `mvn compile` を実行してください。

source: Consuming the datasource
ja_jp: データソースの消費

source: Consuming values
ja_jp: 値の利用

source: Contact Information
ja_jp: 連絡先情報

source: Contain a complete test suite of unit and integration tests.
ja_jp: ユニットテストと統合テストの完全なテストスイートを含んでいること。

source: Container First
ja_jp: コンテナ・ファースト

source: Container Image Options
ja_jp: コンテナーイメージオプション

source: Container Image extensions
ja_jp: コンテナーイメージのエクステンション

source: Container Images
ja_jp: コンテナーイメージ

source: Container Resources Management
ja_jp: コンテナーリソース管理

source: Container affinity
ja_jp: コンテナーとの親和性

source: Container image
ja_jp: コンテナーイメージ

source: Container image size
ja_jp: コンテナーイメージサイズ

source: Container images
ja_jp: コンテナイメージ

source: Container optimal
ja_jp: コンテナーに最適

source: Container-First Architecture
ja_jp: コンテナーファーストアーキテクチャ

source: Container-managed Concurrency
ja_jp: コンテナー管理型の並行処理

source: Container-managed Concurrency Example
ja_jp: コンテナー管理された並行処理の例

source: Container:: when we discuss Quarkus running in... containers
ja_jp: Container:: コンテナ内で実行されるQuarkusについて説明する場合

source: Containerize native applications using virtual threads
ja_jp: 仮想スレッドを使用したネイティブアプリケーションのコンテナー化

source: Containerized Vale
ja_jp: コンテナ化されたVale

source: Containers
ja_jp: コンテナ

source: Containers are really Linux. As such, Linux containers cannot run natively on macOS or Windows. Therefore, the containers must run in a Linux virtual machine (VM), and a Podman client interacts with that VM. A native hypervisor subsystem and virtualization software is used to run the Linux VM on the OS, and then containers are run within this VM. In Podman, this is known as the Podman machine, and it is built into the tool.
ja_jp: コンテナーは Linux そのものです。そのため、Linux コンテナーは macOS または Windows でネイティブに実行できません。したがって、コンテナーは Linux 仮想マシン (VM) で実行する必要があり、Podman クライアントはその仮想マシンと対話します。ネイティブのハイパーバイザーサブシステムと仮想化ソフトウェアを使用して、OS 上で Linux 仮想マシンを実行し、その仮想マシン内でコンテナーを実行します。Podman では、これは Podman マシンと呼ばれ、ツールに組み込まれています。

source: Contains an `AnnotationStore` that keeps information about all `AnnotationTarget` annotations after application of annotation transformers
ja_jp: アノテーショントランスフォーマーを適用した後は、すべての `AnnotationTarget`アノテーションに関する情報を保持する `AnnotationStore` が含まれます

source: Content Filter Example
ja_jp: コンテンツフィルター例

source: Content Filters
ja_jp: コンテンツフィルタ

source: Content Types
ja_jp: コンテンツタイプ

source: Content copied in this way is referenced by the `\{code-examples}` source attribute. The literal string `{{source}}` in the source file, if present, will be replaced with the path of the source file in the copy.
ja_jp: この方法でコピーされたコンテンツは、 `{code-examples}` source属性で参照されます。ソースファイル内にリテラル文字列 `{{source}}` が存在する場合は、コピー先のソースファイルのパスに置き換えられます。

source: Content copied in this way is referenced using the `\{code-examples}` source attribute. If a copied file contains the literal string `{{source}}`, that literal value is replaced with the path of the source file.
ja_jp: この方法でコピーされたコンテンツは、 `\{code-examples}` source属性を使って参照されます。コピーされたファイルにリテラル文字列 `{{source}}` が含まれている場合、そのリテラル値はソースファイルのパスに置き換えられます。

source: Content encryption algorithm. Checked if the JWT encryption builder has not already set the content encryption algorithm.
ja_jp: コンテンツ暗号化アルゴリズム。JWT 暗号化ビルダーがコンテンツ暗号化アルゴリズムをまだ設定していないかどうかを確認します。

source: Content encryption algorithm. This property will be checked if the JWT encryption builder has not already set the content encryption algorithm.
ja_jp: コンテンツ暗号化アルゴリズム。このプロパティーは、JWT 暗号化ビルダーがコンテンツ暗号化アルゴリズムをまだ設定していない場合にチェックされます。

source: Content example
ja_jp: コンテンツ例

source: Content filters can be used to modify the template contents before parsing.
ja_jp: コンテンツフィルタを使用して、解析前にテンプレートコンテンツを変更することができます。

source: Content from this repository is published to the https://quarkus.io/guides/[Quarkus.io website].
ja_jp: このリポジトリからのコンテンツは、 https://quarkus.io/guides/[Quarkus.io ウェブサイト] に公開されます。

source: Context
ja_jp: コンテキスト

source: Context Name
ja_jp: コンテキスト名

source: Context Propagation
ja_jp: コンテキストの伝搬

source: Context Propagation for CDI
ja_jp: CDIのためのコンテキスト伝搬

source: Context Propagation in Quarkus
ja_jp: Quarkusでのコンテキスト伝搬

source: Context Propagation is enabled by default when using Mutiny Uni and Multi
ja_jp: Mutiny UniおよびMultiを使用する場合、Context伝搬はデフォルトで有効です。

source: Context Propagation with Emitters
ja_jp: Emitter によるコンテキスト伝搬

source: Context Propagation: capture and propagate contextual objects (transaction, principal…) in a reactive pipeline
ja_jp: Context Propagation: リアクティブ・パイプラインでコンテキスト・オブジェクト（トランザクション、プリンシパル...）を捕捉し、伝搬させます。

source: Context and duplicated context
ja_jp: コンテキストと重複コンテキスト

source: Context injection
ja_jp: コンテキストの注入

source: Context local data
ja_jp: コンテキスト・ローカルデータ

source: Context local data provides an efficient way to propagate objects during a reactive execution. Tracing metadata, metrics, and sessions can be stored and retrieved safely.
ja_jp: コンテキストローカルデータは、リアクティブ実行中にオブジェクトを伝播する効率的な方法を提供します。 トレースメタデータ、メトリクス、セッションを安全に保存し、取り出すことができます。

source: Context locals restrictions
ja_jp: コンテクスト・ローカルの制限

source: Context propagation into the health check invocations
ja_jp: ヘルスチェック呼び出しへのコンテキストの伝搬

source: Context propagation with InMemoryConnector
ja_jp: InMemoryConnector によるコンテキストの伝播

source: Contexts
ja_jp: コンテキスト

source: Contexts and Dependency Injection
ja_jp: コンテキストと依存性インジェクション

source: Contextual RAG (Multi-Sources, Rerank, Injection)
ja_jp: コンテキストRAG (マルチソース、再ランク付け、注入)

source: Contextual RAG focuses on integrating Retrieval-Augmented Generation (RAG) to ground Large Language Model (LLM) responses in organizational data.
ja_jp: コンテキストRAGは、検索拡張生成（RAG）を統合して、大規模言語モデル（LLM）の応答を組織データに基づかせることに焦点を当てています。

source: Contextual RAG query image
ja_jp: コンテキストRAGクエリ画像

source: Contextual information is injected via the `@Context` annotation which can be used on a function parameter or a class field. A good example is the `io.quarkus.funqy.knative.events.CloudEvent` interface that comes with our Funqy Knative Cloud Events integration:
ja_jp: コンテキスト情報は、ファンクションのパラメータやクラスのフィールドに使用できる `@Context` アノテーションを介して注入されます。例として、 Funqy Knative Cloud Events に搭載されている `io.quarkus.funqy.knative.events.CloudEvent` インターフェースがあります。

source: Contextual objects
ja_jp: コンテキスト・オブジェクト

source: Continue expanding our Quarkus foundation
ja_jp: 引き続き、Quarkusの基盤を拡大

source: Continuing from the previous minimal configuration, your Quarkus application can receive message payload directly:
ja_jp: 直前の最小設定によって、Quarkus アプリケーションはすぐにメッセージペイロードを受信できます。

source: Continuous Testing
ja_jp: 継続的テスト

source: Continuous Testing Without Dev Mode
ja_jp: 開発モードを使わない継続的なテスト

source: Continuous Testing is part of a long tradition of developer-targeted innovation in Quarkus. As such, we are eager to hear about your feedback on it and how we can make it even better.
ja_jp: 継続的なテストは、Quarkusにおける開発者を対象とした革新の長い伝統の一部です。そのため、私たちはそれについてのあなたのフィードバックと、更に良くする方法について聞いてみたいと思っています。

source: Continuous testing for multi module projects
ja_jp: マルチモジュールプロジェクトにおける継続的テスト

source: Continuous testing of your extension
ja_jp: エクステンションの継続的なテスト

source: Continuous testing supports multiple configuration options that can be used to limit the tests that are run, and to control the output. The configuration properties are shown below:
ja_jp: 継続的テストでは、実行するテストを制限したり、出力を制御したりするために使用できる複数の設定オプションをサポートしています。設定項目は以下のとおりです。

source: Continuous testing will now run tests from all the project modules, with the option to configure the old behaviour. The new config options include:
ja_jp: 継続的テストでは、プロジェクトのすべてのモジュールのテストが実行されるようになりました。従来の動作を設定するオプションも用意されています。新しい設定オプションは以下の通りです。

source: Continuously Measuring, Continuously Improving
ja_jp: 継続的な測定、継続的な改善

source: Continuum
ja_jp: コンティニュアム

source: Contract-first approach
ja_jp: 契約ファーストのアプローチ

source: Contrary to the link:{pgsql-driver}[postgresql-jdbc driver], no `synchronized` block is used where it shouldn't be, and the `await` behaviour is implemented using locks and latches that won't cause pinning.
ja_jp: link:{pgsql-driver}[postgresqlのjdbcドライバ] とは逆に、 `synchronized` ブロックが使用されるべきではない場所で使用されることはなく、 `await` 動作は、拘束を発生させないロックとラッチを使用して実装されています。

source: Contrary to what happens with `@InjectMock`, when using `@InjectSpy` for a bean that used CDI observers, these observers are not disabled but executed as per the normal CDI rules.
ja_jp: `@InjectMock` の場合とは異なり、CDI オブザーバーを使用する Bean に対して `@InjectSpy` を使用すると、これらのオブザーバーは無効にならず、通常の CDI ルールに従って実行されます。

source: Contribute to Quarkus documentation
ja_jp: Quarkusドキュメントの寄稿方法

source: Contribute to the documentation by using the recommended diataxis content types, steps, workflow, and style guidance to ensure the content successfully renders on the Quarkus website portal.
ja_jp: QuarkusのWebサイトポータルでコンテンツが正常にレンダリングされるように、推奨されるコンテンツタイプ、ステップ、ワークフロー、スタイルガイダンスを使用して、ドキュメントに貢献します。

source: Contribute to the documentation by using the recommended steps, workflow, and style guidance to ensure the content successfully renders on the Quarkus website portal.
ja_jp: 推奨される手順、ワークフロー、スタイルガイダンスを使用して、Quarkusウェブサイトのポータルでコンテンツが正常にレンダリングされるようにし、ドキュメントを寄稿します。

source: Contributing
ja_jp: 貢献

source: Contributing to Dev UI
ja_jp: Dev UIへの貢献

source: Contributions are welcome to improve the translations and add new languages.
ja_jp: 翻訳の改善や新しい言語の追加への貢献を歓迎します。

source: Contributors
ja_jp: コントリビューター

source: Control
ja_jp: コントロール

source: Control and restrict outbound network access
ja_jp: アウトバウンドネットワークアクセスを制御および制限する

source: Control the maximum concurrency
ja_jp: 最大同時実行数の制御

source: Controller method parameter types
ja_jp: コントローラメソッドのパラメーターの型

source: Controller method return types
ja_jp: コントローラメソッドの戻り値の型

source: Controlling Continuous Testing
ja_jp: 継続的なテストのコントロール

source: Controlling Dev Services
ja_jp: Dev Services の制御

source: Controlling HTTP Caching features
ja_jp: HTTP キャッシング機能の制御

source: Controlling HTTP interaction timeout
ja_jp: HTTP インタラクションタイムアウトの制御

source: Controlling Service Lifecycle with Compose
ja_jp: Compose でのサービスライフサイクルの制御

source: Controlling notifications
ja_jp: 通知の制御

source: Controlling re-use
ja_jp: 再利用の制御

source: Controlling the generated init container
ja_jp: 生成されたinitコンテナーの制御

source: Controlling the generated job
ja_jp: 生成されたジョブの制御

source: Controlling the test port
ja_jp: テストポートの制御

source: Controlling the training phase
ja_jp: トレーニングフェーズの制御

source: Convenient Annotation For Enums
ja_jp: enum の便利なアノテーション

source: Conventions
ja_jp: 規約

source: Conversely, WebSocket typically involves a single endpoint for the initial HTTP connection, after which all messages utilize the same TCP connection. It introduces an entirely different interaction model: asynchronous and message-driven.
ja_jp: 逆に、WebSocket では通常、最初の HTTP 接続に単一のエンドポイントが使用され、その後、すべてのメッセージが同じ TCP 接続を利用します。 これにより、非同期かつメッセージ駆動型のまったく異なるインタラクションモデルが導入されます。

source: Conversely, if the processing throws an exception, all messages are _nacked_, applying the failure strategy for all the records inside the batch.
ja_jp: 逆に、処理が例外をスローした場合、すべてのメッセージは _nack_ され、バッチ内のすべてのレコードにエラーストラテジーが適用されます。

source: Conversely, setting `quarkus.datasource.jdbc.enable-metrics` to `true` (or `quarkus.datasource.<datasource name>.jdbc.enable-metrics` for a named datasource) explicitly can be used to enable collection of metrics even if a metrics extension is not in use. This can be useful if you need to access the collected metrics programmatically. They are available after calling `dataSource.getMetrics()` on an injected `AgroalDataSource` instance. If collection of metrics is disabled for this data source, all values will be zero.
ja_jp: 逆に、明示的に `quarkus.datasource.jdbc.enable-metrics` を `true` (名前付きデータソースの場合は `quarkus.datasource.<datasource name>.jdbc.enable-metrics`) に設定することで、メトリクス拡張が使用されていなくても、メトリクスの収集を有効にすることができます。これは、収集したメトリクスにプログラムでアクセスする必要がある場合に便利です。インジェクト下 `AgroalDataSource` インスタンスで `dataSource.getMetrics()` を呼び出した後に利用できます。このデータソースでメトリクスの収集が無効になっている場合、すべての値はゼロになります。

source: Conversely, setting `quarkus.datasource.jdbc.enable-metrics` to `true`, or `quarkus.datasource.<datasource name>.jdbc.enable-metrics` for a named datasource explicitly enables metrics collection even if a metrics extension is not in use. This can be useful if you need to access the collected metrics programmatically. They are available after calling `dataSource.getMetrics()` on an injected `AgroalDataSource` instance.
ja_jp: 逆に、名前付きデータソースに対して `quarkus.datasource.jdbc.enable-metrics` を `true` 、または `quarkus.datasource.<datasource name>.jdbc.enable-metrics` に設定すると、メトリッ ク・エクステンションが使用されていなくても、明示的にメトリクスの収集が可能になります。 これは、収集されたメトリクスにプログラムでアクセスする必要がある場合に便利です。 これらは、注入された `AgroalDataSource` インスタンスで `dataSource.getMetrics()` を呼び出した後に使用できます。

source: Conversion Table
ja_jp: 変換テーブル

source: Conversions
ja_jp: 変換

source: Convert each `io.vertx.mutiny.sqlclient.Row` to a `Fruit`.
ja_jp: 各 `io.vertx.mutiny.sqlclient.Row` を `Fruit` に変換します。

source: Converter priority
ja_jp: コンバーターの優先順位

source: Converters for reactive types from various reactive programming libraries
ja_jp: 様々なリアクティブプログラミングライブラリのリアクティブ型用コンバーター

source: Converting a received multipart object into a client request
ja_jp: 受信したマルチパートオブジェクトをクライアントリクエストに変換する

source: Cookie per token
ja_jp: トークンごとの Cookie

source: Cookie value
ja_jp: クッキーの値

source: Cookies
ja_jp: クッキー

source: Cool stuff right? <a href="https://quarkus.io/guides/maven-tooling#dev-mode">Learn more about Quarkus's dev mode</a>.
ja_jp: 素晴らしいでしょう？<a href="https://quarkus.io/guides/maven-tooling#dev-mode">Quarkus の開発モードの詳細はこちら</a>。

source: Coordinated Omission Problem in Tools
ja_jp: ツールにおける協調的省略（Coordinated omission）問題

source: Coordinated omission Problem in Tools
ja_jp: ツールにおける協調的省略（Coordinated omission）問題

source: Coordination through outbox polling
ja_jp: アウトボックスポーリングによる調整

source: Coordination through outbox polling is considered preview.
ja_jp: アウトボックスポーリングによる調整は、プレビューとみなされます。

source: Copy `docs/src/main/diataxis/_templates/template-tutorial.adoc` from the Quarkus repository into a new file called `acme-serve-http-requests-tutorial.adoc`.
ja_jp: `docs/src/main/diataxis/_templates/template-tutorial.adoc` を Quarkus リポジトリーから `acme-serve-http-requests-tutorial.adoc` という名前の新しいファイルにコピーします。

source: Copy and paste the contents of the script into a file called `import.cypher`.
ja_jp: スクリプトの内容を `import.cypher` というファイルにコピー＆ペーストします。

source: Copy one of the existing https://github.com/quarkusio/quarkus/tree/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[Quarkus core extension codestarts, window="_blank"]. If the code needs to expose a web resource, `resteasy-qute-codestart` could be a good base Otherwise, `config-yaml-codestart` could be a better starting point. More info on the <<directory-structure>>.
ja_jp: 既存の link:https://github.com/quarkusio/quarkus/tree/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[Quarkusコアエクステンションのcodestart, window=_blank]の1つをコピーします。コードがウェブリソースを公開する必要がある場合は、 `resteasy-qute-codestart` が良いベースとなるでしょう。そうでない場合は、 `config-yaml-codestart` がより良い出発点となるでしょう。詳細は link:#directory-structure[ディレクトリ構造]を参照してください。

source: Copy the JVM Dockerfile to the root directory of your project: `cp src/main/docker/Dockerfile.jvm Dockerfile`.
ja_jp: JVMのDockerfileをプロジェクトのルートディレクトリーにコピーします: `cp src/main/docker/Dockerfile.jvm Dockerfile` .

source: Copy the `docker-compose.yaml` file in your project, and from a terminal, start your broker with: `docker-compose up -d'
ja_jp: プロジェクト内に `docker-compose.yaml` ファイルをコピーし、ターミナルから、ブローカーを起動します: `docker-compose up -d`

source: Copy the `docker-compose.yaml` file in your project, and from a terminal, start your broker with: `docker-compose up -d`
ja_jp: プロジェクト内に `docker-compose.yaml` ファイルをコピーし、ターミナルから、ブローカーを起動します: `docker-compose up -d`

source: Copy the build.gradle, gradle.properties and settings.gradle into the above generated Maven archetype project, to follow along with this guide.
ja_jp: build.gradle、gradle.properties、settings.gradleを上記の生成されたMavenのアーキタイププロジェクトにコピーして、このガイドに従ってください。

source: Copy the build.gradle, gradle.properties and settings.gradle into the above-generated Maven archetype project, to follow along with this guide.
ja_jp: このガイドと揃えるために、build.gradle、gradle.properties、settings.gradleを上記の生成されたMaven archetypeプロジェクトにコピーしてください。

source: Copy the native Dockerfile to the root directory of your project: `cp src/main/docker/Dockerfile.native Dockerfile`.
ja_jp: ネイティブのDockerfileをプロジェクトのルートディレクトリーにコピーします: `cp src/main/docker/Dockerfile.native Dockerfile` .

source: Copy the tutorial template
ja_jp: チュートリアルテンプレートのコピー

source: Copy your Client ID and Client Secret:
ja_jp: Client ID と Client Secret をコピーします。

source: Copy your current "Installed JRE" definition into a new one, where you will add the properties as a new VM arguments:
ja_jp: 現在の"Installed JRE"定義を新しい定義にコピーし、新しいVMの引数としてプロパティーを追加します:

source: Copy/paste that code for the `GreetingResource` class in the quickstart project:
ja_jp: クイックスタートプロジェクトの `GreetingResource` クラスのコードをコピーして貼り付けます。

source: Copying handpicked libraries makes up for a small container image, yet it is somewhat britte, differs for different base image versions, and it is a subject to change as transitive dependencies of these libraries might change.
ja_jp: 厳選されたライブラリーをコピーすると、コンテナーイメージは小さくなりますが、やや脆弱であり、ベースイメージのバージョンによって異なり、これらのライブラリーの移行的依存関係が変更される可能性があるため、変更される可能性があります。

source: Core
ja_jp: コア

source: Core Features
ja_jp: コア機能

source: Core components of the Quarkus Security architecture
ja_jp: Quarkus Securityアーキテクチャのコアコンポーネント

source: Core properties
ja_jp: コアプロパティー

source: Coroutines support
ja_jp: コルーチンのサポート

source: Coroutines with Kotlin
ja_jp: Kotlinのコルーチン

source: Correct
ja_jp: 正しい

source: Correct and incorrect cross-reference phrases
ja_jp: 正しいクロスリファレンスの文章および誤ったクロスリファレンスの文章

source: Correlates and groups `api-version` and `kind` properties together
ja_jp: `api-version` と `kind` のプロパティーを相互に関連付け、グループ化する

source: Counters
ja_jp: カウンター

source: Counters are used to measure values that only increase.
ja_jp: カウンターは、増加するだけの値を測定するために使用されます。

source: Counters are used to measure values that only increase. In the example below, you will count the number of times you test a number to see if it is prime:
ja_jp: カウンタは、増加するだけの値を測定するために使用されます。以下の例では、ある数字が素数であるかどうかを調べる回数を数えます。

source: Counters can be used to measure non-negative, increasing values.
ja_jp: カウンターは、負ではない、増加する値を測定するために使用できます。

source: Counters measure values that only increase. Use one of the methods below to create a counter.
ja_jp: カウンターは増加する値のみを測定します。 カウンターを作成するには、以下のいずれかの方法を使用します。

source: Country and timezone
ja_jp: 国とタイムゾーン

source: Course Language: {{ item.language }}
ja_jp: コース言語: {{ item.language }}

source: Course Type: {{ item.type }}
ja_jp: コースタイプ: {{ item.type }}

source: Coverage for Integration Tests
ja_jp: 結合テストのカバレッジ
